__version__ = (1, 9, 9)
from .. import loader, utils
from telethon.tl.types import Message
import asyncio

# meta developer: @imloveonegirl, @Billi_cum

@loader.tds
class LikeAndDislikeMod(loader.Module):
    """👎👍🏿"""

    strings = {"name": "like_and_dislike"}

    async def discmd(self, message: Message) -> None:
        """👎"""
        dis = ["👎👎👎👎👎👎👎👎👎", "👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎", "👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎",
        "👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎", "👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻",
        "👎👎👎👎👎👎👎👎👎\n👎👎👎👎👎👎👎👎👎\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎👎👎👎👎👎👎👎👎\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻",
        "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻"] + ["👎", "👎🏻", "👎🏽","👎🏾","👎🏿"] * 3 + [ "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", 
        "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿", "👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿\n👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾", "👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿\n👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾\n👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽", "👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿\n👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾\n👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿\n👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾👎🏾\n👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽👎🏽\n👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻\n👎👎👎👎👎👎👎👎👎", "👎👎🏻👎🏽👎🏾👎🏿", "👎🏿👎👎🏻👎🏽👎🏾", "👎🏾👎🏿👎👎🏻👎🏽", "👎🏽👎🏾👎🏿👎👎🏻","👎🏻👎🏽👎🏾👎🏿👎"]
        arg = utils.get_args_raw(message)
        if arg == "i" :
            a = await self.animate(message, dis, interval=0.01, inline=True)
            await asyncio.sleep(2)
            await a.edit(f"<d>Не одобряю</d>")
            await asyncio.sleep(2)
            await a.edit("🟥🟥🟥🟥🟥🟥🟥🟥\n🟥🟥⬜️⬜️⬜️⬜️ ⬜️🟥\n🟥🟥⬜️⬜️⬜️⬜️ ⬜️🟥\n🟥⬜️⬜️⬜️⬜️⬜️ ⬜️🟥\n🟥🟥🟥🟥⬜️⬜️🟥🟥\n🟥🟥🟥🟥🟥🟥🟥🟥")
        if not arg :
            a = await self.animate(message, dis, interval=0.01, inline=False)
            await asyncio.sleep(2)
            await a.edit("<b>Не одобряю</b>")
            await asyncio.sleep(2)
            await a.edit("🟥🟥🟥🟥🟥🟥🟥🟥\n🟥🟥⬜️⬜️⬜️⬜️ ⬜️🟥\n🟥🟥⬜️⬜️⬜️⬜️ ⬜️🟥\n🟥⬜️⬜️⬜️⬜️⬜️ ⬜️🟥\n🟥🟥🟥🟥⬜️⬜️🟥🟥\n🟥🟥🟥🟥🟥🟥🟥🟥")
        if arg == "donat" :
            a = 1
            await self.inline.form("<b>!МЫ ПРОТИВ РАСИЗМА!</b>", message , reply_markup={"text": "фонд борьбы с расизмом", "url": "http://t.me/CryptoBot?start=IVfSpdb91sMg"}) 
    async def likecmd(self, message: Message) -> None:
        """👍🏿"""
        like = ["👍👍👍👍👍👍👍👍👍", "👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍", "👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍",
        "👍👍👍👍👍👍👍👍👍\n 👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍", "👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻",
        "👍👍👍👍👍👍👍👍👍\n👍👍👍👍👍👍👍👍👍\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍👍👍👍👍👍👍👍👍\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻",
        "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻"] + ["👍", "👍🏻", "👍🏽","👍🏾","👍🏿"] * 3 + [ "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", 
        "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿", "👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿\n👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾", "👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿\n👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾\n👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽", "👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿\n👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾\n👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿\n👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾👍🏾\n👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽👍🏽\n👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻\n👍👍👍👍👍👍👍👍👍", "👍👍🏻👍🏽👍🏾👍🏿", "👍🏿👍👍🏻👍🏽👍🏾", "👍🏾👍🏿👍👍🏻👍🏽", "👍🏽👍🏾👍🏿👍👍🏻","👍🏻👍🏽👍🏾👍🏿👍"]
        arg = utils.get_args_raw(message)
        if arg == "i" :
            a = await self.animate(message, like, interval=0.01, inline=True)
            await asyncio.sleep(2)
            await a.edit("<d>Одобряю</d>")
            await asyncio.sleep(2)
            await a.edit("🟦🟦🟦🟦🟦🟦🟦🟦\n🟦🟦 ⬜️🟦🟦🟦🟦🟦\n🟦⬜️ ⬜️⬜️⬜️⬜️⬜️🟦\n🟦⬜️ ⬜️⬜️⬜️⬜️🟦🟦\n🟦⬜️ ⬜️⬜️⬜️⬜️🟦🟦\n🟦🟦🟦🟦🟦🟦🟦🟦")
        if not arg :
            a = await self.animate(message, like, interval=0.01, inline=False)
            await asyncio.sleep(2)
            await a.edit("<b>Одобряю</b>")
            await asyncio.sleep(2)
            await a.edit("🟦🟦🟦🟦🟦🟦🟦🟦\n🟦🟦 ⬜️🟦🟦🟦🟦🟦\n🟦⬜️ ⬜️⬜️⬜️⬜️⬜️🟦\n🟦⬜️ ⬜️⬜️⬜️⬜️🟦🟦\n🟦⬜️ ⬜️⬜️⬜️⬜️🟦🟦\n🟦🟦🟦🟦🟦🟦🟦🟦")
        if arg == "donat" :
            a = 1
            await self.inline.form("<b>!МЫ ПРОТИВ РАСИЗМА!</b>", message , reply_markup={"text": "фонд борьбы с расизмом", "url": "http://t.me/CryptoBot?start=IVfSpdb91sMg"}) 
