__version__ = (1, 0, 0)
from .. import loader, utils
from telethon.tl.types import Message

# meta developer: @imloveonegirl

@loader.tds
class noobMod(loader.Module):
    """супер пупер"""

    strings = {"name": "noob"}

    async def noobcmd(self, message: Message) -> None:
        """сам увидишь"""
        frame = ["⬜⬜⬜⬜⬜", "⬜⬜⬜⬜⬜\n⬜️🟩🟩🟩⬜️", "⬜⬜⬜⬜⬜\n⬜️🟩🟩🟩⬜️\n⬜️⬜️🟩⬜️⬜️", "⬜⬜⬜⬜⬜\n⬜️🟩🟩🟩⬜️\n⬜️⬜️🟩⬜️⬜️\n⬜️⬜️🟩⬜️⬜️",
         "⬜⬜⬜⬜⬜\n⬜️🟩🟩🟩⬜️\n⬜️⬜️🟩⬜️⬜️\n⬜️⬜️🟩⬜️⬜️\n⬜⬜⬜⬜⬜", "⬜⬜⬜⬜⬜\n⬜️🟩🟩🟩⬜️\n⬜️⬜️🟩⬜️⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜⬜⬜⬜⬜",
         "⬜⬜⬜⬜⬜\n⬜️🟩🟩🟩⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜⬜⬜⬜⬜", "⬜⬜⬜⬜⬜\n⬜️🟩🟩⬜⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜⬜⬜⬜⬜",
         "⬜⬜⬜⬜⬜\n⬜️🟩⬜⬜⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜⬜⬜⬜⬜", "⬜⬜⬜⬜⬜\n⬜️⬜⬜⬜⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜️⬜️⬜⬜️⬜️\n⬜⬜⬜⬜⬜",
         "🟩⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜", "🟩⬜⬜⬜🟩\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜", "🟩⬜⬜⬜🟩\n🟩⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜","🟩⬜⬜⬜🟩\n🟩⬜⬜🟩⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜",
         "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜", "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜",
         "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜", "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜🟩\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜",
         "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜🟩\n🟩⬜⬜⬜⬜\n⬜⬜⬜⬜⬜", "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜🟩\n🟩🟩⬜⬜⬜\n⬜⬜⬜⬜⬜",
         "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜🟩\n🟩🟩⬜⬜🟩\n⬜⬜⬜⬜⬜","🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜🟩\n🟩🟩⬜⬜🟩\n🟩⬜⬜⬜⬜", "🟩⬜⬜⬜🟩\n🟩⬜⬜🟩🟩\n🟩⬜🟩⬜🟩\n🟩🟩⬜⬜🟩\n🟩⬜⬜⬜🟩"]
        m = await self.animate(
            message,
            frame,
            interval=0.3,
            inline=False,
        )
        await m.edit(f"<a>ти нуб<a>")